[
    {
        "Name": "Bansang",
        "Dek": "Two fine-dining chefs collaborate on an offbeat Korean menu in the Fillmore neighborhood.",
        "Text": "Bansang, which opened in spring 2022, serves quirky and upscale Korean dishes cooked by fine-dining veterans: chefs Ethan Min and Jin Lim, working in collaboration with the Daeho restaurant group. Warm, wood-paneled walls and upholstered banquettes give the space a cabin-like vibe. Min and Lim get funky with their menu, refreshing the Korean canon with culinary shout-outs that can seem irreverent at times. Instead of mignonette, raw oysters ($4) are perked up with a white kimchi salsa and seaweed oil; radish kimchi fried rice ($15) receives an umami-boosting shower of grated Parmesan. A steamed egg dish ($19) with grassy jalapeño sauce is more custard-like than fluffy, served in a small ceramic bowl. Taken with the saline slick of caviar, of which there is a generous and sculptural dollop, the parts coalesce into a whole that, somehow, makes sense.",
        "City": "San Francisco",
        "Display_Location": "1560 Fillmore St., San Francisco",
        "Phone_Number": "415-697-5879",
        "Website": "http://bansangsf.com",
        "Online_Ordering": "",
        "Takeout": "No",
        "Delivery": "No",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer, wine and soju",
        "Payment": "Credit cards accepted",
        "ImageID": "22141469; 22674135",
        "Image_Preview": "",
        "Image_Credit": "Courtesy Ethan Min; Soleil Ho / The Chronicle",
        "Alt_Text": "Two dark-haired men in aprons stand in a restaurant.; A white bowl filled with egg custard and black caviar.",
        "Location": "1560 Fillmore St., San Francisco",
        "Lat": 37.78406,
        "Lng": -122.43256,
        "safestring": "Bansang"
    },
    {
        "Name": "Bart Grocery",
        "Dek": "A grocery store doubles as a bustling home for Korean rice plates.",
        "Text": "At Bart Grocery, a shop a few blocks away from the Daly City Station, the shelves are stocked with Choco Pies, Campbell’s soups and jars of kimchi. Though recently bought by former tech workers Karina and William Lee, the bodega maintains its old-school charm. Along one wall is a bustling kitchen, where cooks (and the owners) scoop rice and grill meats for the grocery’s menu of Korean barbecue plates. Thin-cut short ribs ($18.95) are tender, imbued with the aromas of soy sauce and toasted sesame; a quick hit on a hot grill chars the edges and makes each bite smoky. Though Bart Grocery isn’t a full-on restaurant, the quality outshines the setting.",
        "City": "Daly City",
        "Display_Location": "108 Los Olivos Ave., Daly City",
        "Phone_Number": "650-993-8782",
        "Website": "",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "No",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "No",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "Yes",
        "Top_25": "",
        "Drinks": "Beer and wine",
        "Payment": "Credit cards accepted",
        "ImageID": "21558408; 21660483",
        "Image_Preview": "",
        "Image_Credit": "Soleil Ho / The Chronicle; Soleil Ho / The Chronicle",
        "Alt_Text": "A partitioned tray of barbecued short ribs on rice with glass noodles.; A square building labeled \"Bart Grocery\" on a bright evening.",
        "Location": "108 Los Olivos Ave., Daly City",
        "Lat": 37.705787,
        "Lng": -122.464123,
        "safestring": "BartGrocery"
    },
    {
        "Name": "BN Chicken",
        "Dek": "This restaurant’s chicken-and-ginseng soup is curative as well as delicious.",
        "Text": "It’s hard to find samgyetang in the Bay Area, but Santa Clara’s BN Chicken has you covered. You get a whole bird in each order ($23.99), stuffed with glutinous rice, ginseng and garlic, then gently cooked in a healthful broth that’s chock-full of herbs and dried goodies like jujube. Medicinal add-ons, like perilla seed and black garlic, are especially popular with customers who primarily eat here for the health benefits. The soup is more than just medicine, though: It’s pure comfort food, with a complex and rich broth that soothes. Come back in the summer for the restaurant’s limited-edition cold noodles ($18.99), a refreshing tonic for steamy South Bay days.",
        "City": "Santa Clara",
        "Display_Location": "2725 El Camino Real, Santa Clara",
        "Phone_Number": "408-551-0099",
        "Website": "http://bnchicken.com",
        "Online_Ordering": "https://eappetit.com/bnchicken#",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "Yes",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer and wine",
        "Payment": "Credit cards accepted",
        "ImageID": "21663220; 21662965",
        "Image_Preview": "",
        "Image_Credit": "Adahlia Cole / Special to The Chronicle; Adahlia Cole / Special to The Chronicle",
        "Alt_Text": "Black bowl of clear soup with a chicken inside.; A white building with a lettering that says, \"BN Chicken.\"",
        "Location": "2725 El Camino Real, Santa Clara",
        "Lat": 37.352775,
        "Lng": -121.975726,
        "safestring": "BNChicken"
    },
    {
        "Name": "Chungdam",
        "Dek": "The definitive high-end Korean barbecue spot in the South Bay.",
        "Text": "Chungdam is an outright gorgeous restaurant, full of artistic touches like geometric, cloud-like light fixtures and subtly designed decorative ceramics. Even the outdoor seating area, an enclosed section of the parking lot, is decked out with potted plants and billowing sunshades. The restaurant specializes in short ribs, or galbi, grilled at the table and served with a diverse array of side dishes, like marinated raw crab, acorn jelly and macaroni salad. Try the suwon galbi ($95 per pound), seasoned with brown sugar and a touch of salt, which has just the right balance of sweet and savory. And don’t miss the galbijjim ($77), a monster-size meal of spicy braised short ribs topped with blistered cheese, which is tender, rich and big enough for several people to share.",
        "City": "Santa Clara",
        "Display_Location": "3180 El Camino Real, Santa Clara",
        "Phone_Number": "669-306-4642",
        "Website": "http://chungdamsv.com",
        "Online_Ordering": "https://chungdam.menu11.com/snataclara/order",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "Yes",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer and wine",
        "Payment": "Credit cards accepted",
        "ImageID": "21662736; 21662735",
        "Image_Preview": "",
        "Image_Credit": "Adahlia Cole / Special to The Chronicle; Adahlia Cole / Special to The Chronicle",
        "Alt_Text": "Assorted banchan on white plates.; Beef pieces being grilled.",
        "Location": "3180 El Camino Real, Santa Clara",
        "Lat": 37.351633,
        "Lng": -121.984232,
        "safestring": "Chungdam"
    },
    {
        "Name": "Daeho Kalbijjim and Soup",
        "Dek": "Daeho's bubbling hot stews and braised short ribs will cure your foggy-day blues.",
        "Text": "The ultimate Korean comfort food, kalbijjim ($75) is a belly-warming beef short rib braise that is made for chilly, lonesome nights. Daeho has mastered the homestyle dish, enhancing it with refreshing add-ons like gooey rice cakes, tender carrots and daikon radish, a mountain of shredded cheese, and a spice level that ranges from mild to tear-jerking. Alternating bites of rich, soy sauce- and sugar-braised beef with the restaurant's sharp napa cabbage kimchi is the best way to experience the food. The Japantown restaurant (which also has locations in Milpitas, San Mateo and H Mart in San Francisco) regularly hosts long lines of beef lovers, but grabbing takeout from here is a straightforward and speedy endeavor. Also worth trying is the seolleongtang ($18), a fortified ox marrow bone soup that you season to your taste with salt and pepper.",
        "City": "San Francisco",
        "Display_Location": "1620 Post St., San Francisco",
        "Phone_Number": "415-563-1388",
        "Website": "",
        "Online_Ordering": "https://www.grubhub.com/restaurant/daeho-kalbijjim-and-beef-soup-1620-post-st-san-francisco/2030954",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "Yes",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": 19890790,
        "Image_Preview": "",
        "Image_Credit": "Kimberley Hasselbrink",
        "Alt_Text": "A person spoons soup out of a tabletop pot full of beef short ribs and garlic chives.",
        "Location": "1620 Post St., San Francisco",
        "Lat": 37.786015,
        "Lng": -122.42858,
        "safestring": "DaehoKalbijjimandSoup"
    },
    {
        "Name": "Danbi",
        "Dek": "Korean culinary classics served in a warm and friendly environment.",
        "Text": "San Jose’s Danbi is a sweet, family-run spot with a lengthy menu of soups and stews served incredibly hot. There’s the budae-jigae ($19.95), the “Army” stew filled with tofu, Spam, American cheese, squeaky enoki mushrooms and ramen noodles; and spicy shredded beef soup ($18.95) with slippery udon noodles. The restaurant is also known for its meat jun ($19.95), a Hawaiian-Korean dish made of crisp pieces of thin-cut, soy sauce-marinated beef cooked in an egg batter. Moist and tender, it’s a popular option for folks who aren’t so into spicy food. One of the highlights of eating inside is the overwhelmingly cute wall of kids’ drawings in the back of the dining room — a good sign that this place knows how to handle antsy little ones.",
        "City": "San Jose",
        "Display_Location": "1092 N. 1st St., San Jose",
        "Phone_Number": "669-292-5595",
        "Website": "http://danbikoreansj.com",
        "Online_Ordering": "https://danbikoreansj.com/products/items/MTE2Ng/NDc1",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer and wine",
        "Payment": "Credit cards accepted",
        "ImageID": "21660436; 21660437",
        "Image_Preview": "",
        "Image_Credit": "LiPo Ching / Special to The Chronicle; LiPo Ching / Special to The Chronicle",
        "Alt_Text": "A platter of meat jun; Two girls sit at a table facing each other.",
        "Location": "1092 N. 1st St., San Jose",
        "Lat": 37.356109,
        "Lng": -121.904979,
        "safestring": "Danbi"
    },
    {
        "Name": "Don Blanc",
        "Dek": "A Temescal Korean barbecue spot specializing in beef intestines and tender pork.",
        "Text": "Oakland’s Temescal neighborhood is shaping up to be one of the most vibrant Korean restaurant districts in the East Bay, and the opening of Don Blanc makes that argument even stronger. A Korean meat palace that stays grilling until 2 a.m. every day, Don Blanc is made for the party crowd. Slivers of pork rib meat ($28.95) come marinated in a spicy sauce, with a satisfying char developed over hot coals. Servers cook the other meats on a cast iron grill on the table in front of you, complete with a powerful vent that keeps your clothes from absorbing the smoke. One of Don Blanc’s specialties is beef intestine, tender and chewy and available in three sizes.",
        "City": "Oakland",
        "Display_Location": "4390 Telegraph Ave., Oakland",
        "Phone_Number": "510-988-5013",
        "Website": "www.donblanc.com",
        "Online_Ordering": "",
        "Takeout": "No",
        "Delivery": "No",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": "21660482; 21660480",
        "Image_Preview": "",
        "Image_Credit": "Soleil Ho / The Chronicle; Soleil Ho / The Chronicle",
        "Alt_Text": "Spicy pieces of pork on a lettuce bed.; Pork belly on a grill being cut.",
        "Location": "4390 Telegraph Ave., Oakland",
        "Lat": 37.832104,
        "Lng": -122.263088,
        "safestring": "DonBlanc"
    },
    {
        "Name": "Han Il Kwan",
        "Dek": "Homey and popular Korean spot in the Richmond District.",
        "Text": "Family-run Han Il Kwan has a rustic atmosphere, complete with traditional, Chinese-influenced wooden entryways inside the restaurant. The Richmond District restaurant is especially beloved for its affordable lunch specials, which include a main dish with rice, assorted house-made banchan and a brothy soup with jiggly tofu and beef, all for less than $20. At dinnertime, get the family-size meal sets ($190-$230), which include an incredible amount of food: barbecue dishes, pan-fried seafood, stir-fried glass noodles, bibimbap and much more.",
        "City": "San Francisco",
        "Display_Location": "1802 Balboa St., San Francisco",
        "Phone_Number": "415-752-4447",
        "Website": "",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "No",
        "Outdoor_Seating": "Yes",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "Yes",
        "Top_25": "",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": "21660438; 21660439",
        "Image_Preview": "",
        "Image_Credit": "Soleil Ho / The Chronicle; Liz Hafalia / The Chronicle",
        "Alt_Text": "Kimchi rice with a sunny-side up egg on top.; A sign that reads, \"Han Il Kwan.\"",
        "Location": "1802 Balboa St., San Francisco",
        "Lat": 37.77676,
        "Lng": -122.4783,
        "safestring": "HanIlKwan"
    },
    {
        "Name": "Hotline",
        "Dek": "From the owners of Queens comes this California take on Korean Chinese food.",
        "Text": "Korean Chinese cuisine, originator of modern classics like black bean sauce-topped jajangmyeon and spicy seafood noodles, is a favorite of owners Clara Lee and Eddo Kim, who opened Hotline in early 2022. The casual Outer Sunset restaurant has the feel of a diner — the kind of place you might crave when you’re hungover. Lee and Kim’s approach to Korean Chinese food embraces local and seasonal produce: Yang jang pi ($18), a salad of mung bean jelly noodles, is mixed with hot mustard, Pink Lady apples, pea sprouts and heirloom Painted Serpent cucumbers. Geotjeori ($12), a fresh form of kimchi, includes the surprising but effective addition of yellow peaches in the summer.",
        "City": "San Francisco",
        "Display_Location": "3560 Taraval St., San Francisco",
        "Phone_Number": "415-702-6301",
        "Website": "http://hotlineasap.com",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": "22959414; 22959412",
        "Image_Preview": "",
        "Image_Credit": "Brontë Wittpenn / The Chronicle; Brontë Wittpenn / The Chronicle",
        "Alt_Text": "A red tray holding a plate of jelly noodles and stir-fried peppers.; A plate with a steamed bun and stir-fried meat and vegetables.",
        "Location": "3560 Taraval St., San Francisco",
        "Lat": 37.74203,
        "Lng": -122.50446,
        "safestring": "Hotline"
    },
    {
        "Name": "Ilcha",
        "Dek": "For a good time, come here for superb drinking snacks and premium soju.",
        "Text": "In the Marina district, a new Korean gastropub arrived in spring 2022 feeling like a good fit for the clubby neighborhood. Opened by two friends, with one from the family that owns Lucky Pig in the Tenderloin, Ilcha specializes in anju, a Korean genre of drinking food. It makes good on that notion with a serious menu of premium soju bottles and other fermented rice liquors. Tater tots ($19) get topped with tender chopped bulgogi and ooze with mozzarella and pepper jack cheese; shallow pots bubble with spicy stews filled with rice cakes and ramen noodles. Most exciting is a relatively rare dish: ganjang saewoo ($28), a platter of soy sauce-cured shrimp, served fresh and slippery with egg yolk rice.",
        "City": "San Francisco",
        "Display_Location": "2151 Lombard St., San Francisco",
        "Phone_Number": "415-613-9288",
        "Website": "www.ilchasf.com",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer, wine and soju",
        "Payment": "Credit cards accepted",
        "ImageID": 22415779,
        "Image_Preview": "",
        "Image_Credit": "Soleil Ho / The Chronicle",
        "Alt_Text": "A white plate holding raw marinated shrimp.",
        "Location": "2151 Lombard St., San Francisco",
        "Lat": 37.799484,
        "Lng": -122.43681,
        "safestring": "Ilcha"
    },
    {
        "Name": "Jang Su Jang",
        "Dek": "Korean barbecue and family-style dishes served in a glossy interior.",
        "Text": "Enormous mandu dumplings, wiggly acorn jelly salads and lettuce wraps cradling tender grilled pork belly have made Jang Su Jang a constant favorite of Korean cuisine lovers here. Recommend it to your friends who are skeptical that nothing in the Bay Area can match Los Angeles' Korean food offerings. Jang Su Jang’s broad menu includes Korean barbecue classics, gigantic dumplings ($21) and a crustacean-heavy seafood soup ($23) with toothy hand-cut noodles. The fount of banchan flows plentifully here, with morsels like daikon kimchi and steamed eggplant on deck. Open for indoor dining, takeout and delivery at its Santa Clara and Milpitas locations.",
        "City": "Santa Clara",
        "Display_Location": "3561 El Camino Real, Suite 10, Santa Clara",
        "Phone_Number": "408-246-1212",
        "Website": "www.jangsujang.com",
        "Online_Ordering": "https://jangsujang.menu11.com/",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": 19891020,
        "Image_Preview": "",
        "Image_Credit": "Sarah Rice / Special to The Chronicle",
        "Alt_Text": "Bowl of bibimbap with ingredients arrayed like pie slices.",
        "Location": "3561 El Camino Real, Suite 10, Santa Clara",
        "Lat": 37.352537,
        "Lng": -121.994363,
        "safestring": "JangSuJang"
    },
    {
        "Name": "Joodooboo",
        "Dek": "An Oakland deli serving artisanal tofu and Korean banchan with a California touch.",
        "Text": "Joodooboo opened in January with an endearing concept: It’s a deli focused on making fresh tofu and seasonal banchan, complete with banchan subscriptions for those who can’t live without something fermented in the fridge. The tofu ($9) is soft, supple and good enough to eat as-is, and the seasonal banchan (think eggplant bulgogi and pickled sweet peppers) changes weekly. There are usually two prepared dishes on sale, including a bowl of slippery acorn flour noodles ($15) mixed with julienned raw vegetables and a peppery sauce, with dates sweetening the whole deal. On Tuesdays, it puts out a limited lunchbox special of fried tofu that’s worth checking out.",
        "City": "Oakland",
        "Display_Location": "4201 Market St., Oakland",
        "Phone_Number": "510-500-1001",
        "Website": "www.joodooboo.co",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "No",
        "Outdoor_Seating": "Yes",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer and wine",
        "Payment": "Credit cards accepted",
        "ImageID": 22975314,
        "Image_Preview": "",
        "Image_Credit": "Stephen Lam / The Chronicle",
        "Alt_Text": "Two bowls of banchan: pickled radish and kimchi.",
        "Location": "4201 Market St., Oakland",
        "Lat": 37.83255,
        "Lng": -122.273742,
        "safestring": "Joodooboo"
    },
    {
        "Name": "Kunjip",
        "Dek": "Most come to Kunjip for just one thing: wholesome and rich bone broth soups.",
        "Text": "One of the great things about Santa Clara’s density of Korean restaurants is that specialty restaurants like Kunjip are able to thrive. Its menu centerpiece is seolleongtang ($18), a fortifying noodle soup featuring a milky broth made by boiling ox bones for hours. Served unseasoned, the soup is meant to be flavored to your liking with salt, pepper and chopped scallions. (Get the galbitang if you want something that already comes punched up.) Also try the version with beef tendons ($23), boiled until the pieces become super-soft, but still toothy. The line for Kunjip’s indoor and outdoor tables tends to be long at peak times, so budget in some extra time for dinner.",
        "City": "Santa Clara",
        "Display_Location": "1066 Kiely Blvd., Santa Clara",
        "Phone_Number": "408-246-0025",
        "Website": "",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "Yes",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "Yes",
        "Top_25": "",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": "21660440; 21660442",
        "Image_Preview": "",
        "Image_Credit": "Sarah Rice / Special to The Chronicle; Sarah Rice / Special to The Chronicle",
        "Alt_Text": "Bird's eye view of a soup with a beef short rib.; The exterior of a building with a sign that says \"Kunjip Restaurant.\"",
        "Location": "1066 Kiely Blvd., Santa Clara",
        "Lat": 37.345975,
        "Lng": -121.978216,
        "safestring": "Kunjip"
    },
    {
        "Name": "Manna",
        "Dek": "Bubbling spicy tofu soups are a favorite at this pint-size restaurant.",
        "Text": "Opened by former Korean grocery-store owner Moon Young Yun in 2011, Manna has become a key presence in a neighborhood stacked with excellent immigrant-run restaurants and cafes. The Inner Sunset restaurant occupies a prime spot near Golden Gate Park, so you’re in a good position to walk off its well-portioned dinners. The restaurant’s dolsot bibimbap ($15.99), offered in vegetarian, beefy and pescatarian variations, is a comforting rendition of a classic dish. As the rice sears in the hot stone bowl, it takes on a tooth-sticking tackiness. Another highlight is the kimchi fried rice ($13.99), cooked with an appetizing undertone of smokiness.",
        "City": "San Francisco",
        "Display_Location": "845 Irving St., San Francisco",
        "Phone_Number": "415-665-5969",
        "Website": "",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "Yes",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": "21660443; 21660444",
        "Image_Preview": "",
        "Image_Credit": "John Storey / Special to The Chronicle; John Storey / Special to The Chronicle",
        "Alt_Text": "Bowl of bibimbap with an egg on top, surrounded by small dishes.; Storefront on a street corner.",
        "Location": "845 Irving St., San Francisco",
        "Lat": 37.763847,
        "Lng": -122.46709,
        "safestring": "Manna"
    },
    {
        "Name": "Namu Stonepot",
        "Dek": "Bibimbap meets California cuisine at this farmers’ market staple and food hall restaurant.",
        "Text": "If you’re a San Francisco farmers’ market regular, you’re probably familiar with Namu Stonepot, a project by brothers David, Dennis and Daniel Lee. The business has brought a new- wave taste of Korean cuisine to San Francisco since its founding in 2006, with a few brick-and-mortar restaurants and market stalls. Since then, the brothers have gone from sourcing produce from local farmers to growing their own organic vegetables on their own farm in Winters (Yolo County). The Lees’ latest project brings Namu Stonepot to their new beer hall in San Francisco’s Mid-Market neighborhood, where they serve okonomiyaki ($11) and bibimbap-inspired rice bowls ($14) cooked in stone pots and topped with bulgogi, fried tofu and mochiko chicken. All that is served alongside Dennis Lee’s splendid pizza project, Sunset Squares, and Filipino dishes by pop-up Uncle Tito.",
        "City": "San Francisco",
        "Display_Location": "59 9th St., San Francisco",
        "Phone_Number": "",
        "Website": "www.namustonepot.com",
        "Online_Ordering": "https://namufoodhall.square.site",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "Yes",
        "Top_25": "",
        "Drinks": "Beer",
        "Payment": "Credit cards accepted",
        "ImageID": "21313343; 21157034",
        "Image_Preview": "",
        "Image_Credit": "Stephen Lam / Special to The Chronicle; Jessica Christian / The Chronicle",
        "Alt_Text": "Three men stand against a wall.; Communal tables with stools.",
        "Location": "59 9th St., San Francisco",
        "Lat": 37.7768,
        "Lng": -122.41515,
        "safestring": "NamuStonepot"
    },
    {
        "Name": "Omogari",
        "Dek": "Bottomless banchan and spectacular specials make Omogari great for parties.",
        "Text": "Founded by the team behind San Jose’s Danbi, Omogari is another excellent addition to the South Bay city’s nascent Korean food scene. The interior is modest, with muted decor, though the food adds plenty of character to the experience. If you’ve got a taste for over-the-top spectacles — and broiled cheese — Omogari’s got you covered. Check out the Flamin’ Fondue Chicken ($26.95), which combines the gooey sweetness of Korean corn cheese with mildly spicy, gochujang-flavored chicken stir-fry. While the dish is 70% cheese pull, the tender chicken is a delight, especially when paired with bites of the restaurant’s sharp and well-fermented kimchi.",
        "City": "San Jose",
        "Display_Location": "154 Jackson St., San Jose",
        "Phone_Number": "408-288-8134",
        "Website": "http://omogarisj.com",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "Yes",
        "Top_25": "",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": "21663221; 21662964",
        "Image_Preview": "",
        "Image_Credit": "Adahlia Cole / Special to The Chronicle; Adahlia Cole / Special to The Chronicle",
        "Alt_Text": "Black bowl of red kimchi soup with a raw egg cracked into it.; People eating at a table.",
        "Location": "154 Jackson St., San Jose",
        "Lat": 37.348535,
        "Lng": -121.894906,
        "safestring": "Omogari"
    },
    {
        "Name": "Pyeong Chang Tofu House",
        "Dek": "A cozy family-owned restaurant with 10 tofu soups and two locations in the East Bay.",
        "Text": "What do you get at Pyeong Chang Tofu House? I’ll give you three guesses. Run by chef Young S. Kim since 2004, Pyeong Chang Tofu House has earned local acclaim through its bubbly tofu soups, filled with tofu as soft as baby cheeks. Get them as spicy as you like, and definitely ask for a raw egg that you can crack into the bowl as it simmers at the table. That said, the bibimbap menu has some treasures of its own. Try the briny al bibimbap ($22.99), a rare dish served in a hot bowl with a shining heap of orange sweet-and-salty masago roe, oysters and kimchi. The roe pops in the mouth, and the oyster meat amps up the funkiness of the kimchi. Both restaurants (Oakland and Berkeley) are open for indoor seating, takeout and delivery.",
        "City": "Oakland",
        "Display_Location": "4701 Telegraph Ave., Oakland",
        "Phone_Number": "510-658-9040",
        "Website": "www.pctofu.com",
        "Online_Ordering": "https://pyeongchangtofu.menu11.com/oakland/order",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "Yes",
        "Top_25": "",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": 21660457,
        "Image_Preview": "",
        "Image_Credit": "Stephanie Wright Hession / Special to The Chronicle",
        "Alt_Text": "Exterior of a building with a black awning.",
        "Location": "4701 Telegraph Ave., Oakland",
        "Lat": 37.834511,
        "Lng": -122.263406,
        "safestring": "PyeongChangTofuHouse"
    },
    {
        "Name": "Queens",
        "Dek": "Upscale Korean grocer that serves house-made ferments and hot dishes.",
        "Text": "In 2019, Clara Lee and Eddo Kim opened Queens, an Inner Sunset superette where customers could find heirloom Asian produce, Korean-roasted coffee and ready-to-eat banchan like tomato kimchi and shredded soy-braised brisket. This year, they debuted a counter-service lunch restaurant in the space, with a casual dining room in the back of the restaurant so they could take advantage of their prime access to good ingredients. Seafood pancakes ($20) come crisped on the bottom and loaded with pungent garlic chives; and the shop’s own kimchi features in its boiled pork dumplings ($16). The menu is brief, but keep an eye out for specials, including omelet rice and minced beef patties with roasted potatoes and whipped honey butter.",
        "City": "San Francisco",
        "Display_Location": "1235 9th Ave., San Francisco",
        "Phone_Number": "415-702-9382",
        "Website": "www.queenssf.com",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "No",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": "21547452; 21547449",
        "Image_Preview": "",
        "Image_Credit": "Brontë Wittpenn / The Chronicle; Brontë Wittpenn / The Chronicle",
        "Alt_Text": "A pancake of shrimp, squid, garlic, chive and squash on a white plate.; Four circular wooden tables in the dining room at Queens.",
        "Location": "1235 9th Ave., San Francisco",
        "Lat": 37.76527,
        "Lng": -122.46673,
        "safestring": "Queens"
    },
    {
        "Name": "Sammy's",
        "Dek": "Crisp and chewy hotteok stars at this roving East Bay pop-up.",
        "Text": "A pop-up that appears mostly at breweries around Oakland, Sammy’s purports to be the Bay Area’s first pop-up shop to specialize in hotteok, a popular Korean Chinese street food. Founder Sammy Pak plops balls of fresh dough onto a flat-top grill, pressing them into golden-crisp discs with a special metal weight. Like any good bao, the sweet rice flour dough is chewy, tender and satisfying to rip with your teeth. The classic ($4.95) is vegan, made with a mixture of brown sugar, cinnamon and sunflower seeds that melt into a sweet and earthy syrup on the grill. I also loved the Yee Katsu ($6.95), a gooey chicken and cheese version that gets a tangy snap from generous amounts of Japanese Worcestershire sauce in the mix.",
        "City": "",
        "Display_Location": "Locations vary",
        "Phone_Number": "",
        "Website": "www.sammys-food.com",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "No",
        "Outdoor_Seating": "",
        "Indoor_Seating": "",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "Yes",
        "Top_25": "",
        "Drinks": "",
        "Payment": "Credit cards accepted",
        "ImageID": "22959424; 22959423",
        "Image_Preview": "",
        "Image_Credit": "Ethan Swope / The Chronicle; Ethan Swope / The Chronicle",
        "Alt_Text": "Doughy cakes fried on a flat-top grill.; A person walks past a sandwich board with a photo of hotteok.",
        "Location": "Locations vary",
        "safestring": "Sammy's"
    },
    {
        "Name": "San Ho Won",
        "Dek": "Upscale Korean barbecue by the chef-owner of Michelin-starred Benu.",
        "Text": "San Ho Won is wholly invested in making the best possible iterations of Korean barbecue classics. Everything, from the napa cabbage kimchi ($6) to the intense and wobbly steamed egg ($16), feels perfectly dialed-in: the picture of finesse. Barbecue dishes are prepared in the kitchen, cooked over the restaurant’s proprietary solid lychee wood charcoal, which imparts very little odor onto the finished product. The house double-cut galbi ($48 for 8 ounces), glistening with rendered beef fat and cut into thick squares, has the shine of polished stone, with an exterior charred with a deliriously pleasing layer of caramelized sugar.",
        "City": "San Francisco",
        "Display_Location": "2170 Bryant St., San Francisco",
        "Phone_Number": "415-868-4479",
        "Website": "http://sanhowon.com",
        "Online_Ordering": "",
        "Takeout": "No",
        "Delivery": "No",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer, wine, soju and sake",
        "Payment": "Credit cards accepted",
        "ImageID": "22975320; 22674140",
        "Image_Preview": "",
        "Image_Credit": "Courtesy Eric Wolfinger; Courtesy Eric Wolfinger",
        "Alt_Text": "A black bowl filled with souffle-style egg.; A platter of grilled short ribs.",
        "Location": "2170 Bryant St., San Francisco",
        "Lat": 37.75976014,
        "Lng": -122.4102795,
        "safestring": "SanHoWon"
    },
    {
        "Name": "Silla",
        "Dek": "Funky takes on old-school flavors make this one of the most interesting spots in Koreatown.",
        "Text": "The offbeat Silla is singular in Santa Clara’s Korean restaurant scene. Here, chef and co-owner Eric Shin cooks beyond the conventions of Korean cuisine, with the kind of sensibility you’d find at modern restaurants in Seoul: He tops his velvety Better than Cioppino stew ($58) with spongy beef tendon, cod, mussels and more seafood. I’m a big fan of Shin’s take on eel rice ($23), topped with three piles of colored fish roe: enough that each bite is packed with their briny flavor. Give the makgeolli, an old-school alcoholic rice drink, a try: Here, the drinks come blended with fresh fruits and are surprisingly refreshing.",
        "City": "Santa Clara",
        "Display_Location": "2910 El Camino Real, Santa Clara",
        "Phone_Number": "408-320-2829",
        "Website": "www.sillasv.com",
        "Online_Ordering": "https://www.sillasv.com/s/order",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "Yes",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "Yes",
        "Top_25": "",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": 21660479,
        "Image_Preview": "",
        "Image_Credit": "Soleil Ho / The Chronicle",
        "Alt_Text": "A bowl of eel rice with colorful roe on top.",
        "Location": "2910 El Camino Real, Santa Clara",
        "Lat": 37.351872,
        "Lng": -121.979306,
        "safestring": "Silla"
    },
    {
        "Name": "Soban",
        "Dek": "High-quality ingredients and craft beer make this Wine Country restaurant a must-visit.",
        "Text": "There’s a lot of excellent food in Wine Country, but Korean food is still hard to find in the area. Soban, which opened in Petaluma in 2015, is one notable exception. Run by couple Sarah and Daniel Kim, the restaurant can stand shoulder-to-shoulder with its counterparts in the South Bay. Tender, bone-in galbi ($32), grilled chicken ($25) and other barbecue dishes come out on hot iron platters, and each can be upgraded with a set of spicy dipping sauce and lettuce for $4. Sarah Kim ferments the restaurant’s house kimchi for a minimum of four weeks and makes all the banchan from scratch, while Daniel Kim manages the front-of-house and readily explains dishes to newcomers to the cuisine.",
        "City": "Petaluma",
        "Display_Location": "255 N McDowell Blvd., Petaluma",
        "Phone_Number": "707-769-3112",
        "Website": "www.sobanpetaluma.com",
        "Online_Ordering": "www.sobanpetaluma.com",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "Yes",
        "Top_25": "",
        "Drinks": "Beer and wine",
        "Payment": "Credit cards accepted",
        "ImageID": "21665959; 21664790",
        "Image_Preview": "",
        "Image_Credit": "Courtesy Soban; Lisa Gartner/ The Chronicle",
        "Alt_Text": "Arrangement of Korean dishes on a table.; The exterior of the Petaluma restaurant Soban featuring signage spelling the name of the restaurant.",
        "Location": "255 N McDowell Blvd., Petaluma",
        "Lat": 38.251663,
        "Lng": -122.630616,
        "safestring": "Soban"
    },
    {
        "Name": "Toyose",
        "Dek": "A classic late-night spot for soju and ramyeon in the Sunset District.",
        "Text": "When it’s after midnight and you’re craving something to warm your belly, you’ve got to go to Toyose. The Korean pub in the Outer Sunset, just steps from the ocean, is open until 2 a.m. every night with food made to soak up alcohol and ensure a peaceful next morning. (Or you just keep going and order from the restaurant’s large list of powerful sojus.) Bring a group so you can feast on seafood pancakes packed with squid tentacles ($14.95), gooey broiled corn cheese ($7.95), Spam and ramyeon stew ($32.95), and spicy fried chicken wings ($15.95). The chicken has a satisfying lacquered quality with skin made crisp and taut.",
        "City": "San Francisco",
        "Display_Location": "3814 Noriega St., San Francisco",
        "Phone_Number": "415-731-0232",
        "Website": "https://sftoyose.wixsite.com/toyose",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "Yes",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer and wine",
        "Payment": "Credit cards accepted",
        "ImageID": "21402195; 21402196",
        "Image_Preview": "",
        "Image_Credit": "John Storey / Special to The Chronicle; John Storey / Special to The Chronicle",
        "Alt_Text": "Pile of fried chicken on a plate.",
        "Location": "3814 Noriega St., San Francisco",
        "Lat": 37.753219,
        "Lng": -122.504687,
        "safestring": "Toyose"
    },
    {
        "Name": "Volcano Island",
        "Dek": "You’ll find some of the Bay Area’s best Korean fried chicken at this tiny counter spot.",
        "Text": "Light and airy fried chicken is the star at Volcano Island, a counter-service restaurant in a Hayward strip mall. The chicken here is double-fried for maximum crunch and has an impressive lightness to it. Even more impressive is that the boneless version ($14/$27) is just as tender and moist as the bone-in variety ($8/$15/$28). While most customers come for the chicken, the restaurant’s unique Volcano Mash dishes, cheesy casseroles with sweet potato fries and tater tots, are ideal stoner food. The staff is small, so definitely call ahead to order.",
        "City": "Hayward",
        "Display_Location": "2619 Oliver Dr., Hayward",
        "Phone_Number": "510-786-9161",
        "Website": "https://volcano-island.menu11.com",
        "Online_Ordering": "https://volcano-island.menu11.com/hayward/order",
        "Takeout": "Yes",
        "Delivery": "Yes",
        "Outdoor_Seating": "Yes",
        "Indoor_Seating": "No",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Soft drinks",
        "Payment": "Credit cards accepted",
        "ImageID": 21660478,
        "Image_Preview": "",
        "Image_Credit": "Soleil Ho / The Chronicle",
        "Alt_Text": "A red wall mounted with menus and a drink cooler.",
        "Location": "2619 Oliver Dr., Hayward",
        "Lat": 37.627787,
        "Lng": -122.098777,
        "safestring": "VolcanoIsland"
    },
    {
        "Name": "Yu Yu Za Zang",
        "Dek": "Black bean noodles, in all their savory goodness, are the specialty here.",
        "Text": "Korean-Chinese to the core, Oakland’s Yu Yu Za Zang (formerly known as Chef Yu) focuses on Shandong-style dishes customized to Korean tastes. Among the most famous is jajangmyeon, made with hand-pulled noodles and a starchy black bean sauce. The fresh noodles ($9.95) are especially slurpable, and the sauce that tops them has deep, caramel-y notes. Another classic Korean-Chinese dish here, jjamppong ($11.95), is an aromatic and spicy seafood soup with the same bouncy noodles. Can’t choose between the two? Order “zamza myun” ($11.95) to get a half order of both, served in a handy partitioned bowl.",
        "City": "Oakland",
        "Display_Location": "4871 Telegraph Ave., Oakland",
        "Phone_Number": "510-653-2288",
        "Website": "",
        "Online_Ordering": "",
        "Takeout": "Yes",
        "Delivery": "No",
        "Outdoor_Seating": "No",
        "Indoor_Seating": "Yes",
        "Limited_Table_Service": "",
        "Barriers_Between_Tables": "",
        "Tables_Six_Feet_Apart": "",
        "Heat_Lamps": "",
        "Vegetarian": "",
        "Top_25": "",
        "Drinks": "Beer and soju",
        "Payment": "Credit cards accepted",
        "ImageID": 21660477,
        "Image_Preview": "",
        "Image_Credit": "Soleil Ho / The Chronicle",
        "Alt_Text": "A bowl of black bean noodles, with some noodles pulled upward.",
        "Location": "4871 Telegraph Ave., Oakland",
        "Lat": 37.835578,
        "Lng": -122.262986,
        "safestring": "YuYuZaZang"
    }
]